* Worktime
| Start |   End | Hours | Delta | Saldo |
|-------+-------+-------+-------+-------|
| 06:00 | 00:30 | 07:42 |       | 10:00 |
| 08:00 | 16:12 | 07:42 | 00:00 | 10:00 |
| 08:00 | 17:12 | 08:42 | 01:00 | 11:00 |
| 08:00 | 16:02 | 07:32 | 00:10 | 10:50 |
| 08:00 | 18:12 | 09:42 | 02:00 | 12:50 |
| 08:00 | 17:02 | 08:32 | 00:50 | 13:40 |
| 08:00 | 12:00 | 04:00 | 03:42 | 09:58 |
| 08:00 | 15:00 | 06:30 | 01:12 | 08:46 |
| 08:00 | 17:00 | 08:30 | 00:48 | 09:34 |
#+TBLFM: @3$3..@10$3='(if (>= (- $2 $1) @2$1) (- (- $2 $1) @2$2) (- $2 $1));U::@3$4..@10$4='(if (>= $3 @2$3) (- $3 @2$3) (- @2$3 $3));U::@3$5..@10$5='(if (>= $3 @2$3) (+ (- $3 @2$3) @-1) (- @-1 (- @2$3 $3)));U
